# GetChangedCustomHandles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetChangedCustomHandles Method
RebarUpdateCurvesData Class See Also
---
Returns an array containing custom handles that were changed since the last regeneration. Array is empty if no handles were changed since the last regeneration.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<int> GetChangedCustomHandles()
```

Visual Basic
---
```text
Public Function GetChangedCustomHandles As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetChangedCustomHandles()
```

# ### Return Value
Returns an array containing the tags of custom handles that were changed since the last regeneration.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace